app/Controllers/Admin.php

    public function medicines()
    {
        $guard = $this->requireRole(['admin'], '/login');
        if ($guard !== null) {
            return $guard;
        }

        return view('admin/medicines', [
            'pageTitle' => 'Manage Medicines | MediStore',
            'medicines' => model(MedicineModel::class)->orderBy('created_at', 'DESC')->findAll(),
---
SELECT *
FROM `medicines`
ORDER BY `created_at` DESC

    public function editMedicine(int $medicineId)
    {
        $guard = $this->requireRole(['admin'], '/login');
        if ($guard !== null) {
            return $guard;
        }

        $medicine = model(MedicineModel::class)->find($medicineId);
---
SELECT *
FROM `medicines`
WHERE `medicines`.`id` = 19

    public function updateMedicine(int $medicineId)
    {
        $guard = $this->requireRole(['admin'], '/login');
        if ($guard !== null) {
            return $guard;
        }

        $medicineModel = model(MedicineModel::class);
        $medicine = $medicineModel->find($medicineId);
        if ($medicine === null) {
            return redirect()->to('/admin/medicines')->with('error', 'Medicine not found.');
        }

        $data = $this->medicineData($medicineId);
        $image = $this->storeMedicineImage();
        if ($image !== null && isset($image['error'])) {
            return redirect()->back()->withInput()->with('error', $image['error']);
        }

        if ($image !== null) {
            $data['image'] = $image['path'];
        }

        if (! $medicineModel->update($medicineId, $data)) {
---
SELECT *
FROM `medicines`
WHERE `medicines`.`id` = 19
UPDATE `medicines` SET `category_id` = 6, `name` = 'Ecosprin 75', `slug` = 'ecosprin-75', `generic_name` = 'Aspirin', `price` = 38, `discount_price` = 35, `stock` = 280, `description` = 'Ea accusantium architecto est officia. Excepturi autem earum quas et.', `usage_info` = 'Take as directed by your physician. Aperiam eum reprehenderit voluptas voluptate eaque.', `side_effects` = 'May cause mild nausea or dizziness. Enim sunt quia et perferendis culpa nam.', `storage_instructions` = 'Store in a cool, dry place away from direct sunlight.', `prescription_required` = 0, `expiry_date` = '2028-01-27', `status` = 1, `image` = 'medicines/29e0830f9b6fb31e3ae07e2714d0ea8a.jpg', `updated_at` = '2026-07-27 20:39:45'
WHERE `medicines`.`id` IN (19)

    private function uniqueMedicineSlug(string $name, ?int $ignoreId = null): string
    {
        $baseSlug = slugify($name);
        $slug = $baseSlug;
        $suffix = 2;
        $medicineModel = model(MedicineModel::class);

        while (true) {
            $query = $medicineModel->where('slug', $slug);
            if ($ignoreId !== null) {
                $query->where('id !=', $ignoreId);
            }
            if ($query->first() === null) {
---
SELECT *
FROM `medicines`
WHERE `slug` = 'ecosprin-75'
AND `id` != 19
 LIMIT 1