app/Controllers/Auth.php

    public function attemptRegister()
    {
        $userModel = model(UserModel::class);

        $data = [
            'name'     => trim($this->request->getPost('name') ?? ''),
            'email'    => trim($this->request->getPost('email') ?? ''),
            'phone'    => trim($this->request->getPost('phone') ?? ''),
            'password' => $this->request->getPost('password') ?? '',
            'role'     => 'customer',
            'is_active' => 1,
            'email_verified' => 1,
        ];

        if ($data['name'] === '' || $data['email'] === '' || $data['password'] === '') {
            return redirect()->back()->withInput()->with('error', 'Please complete all required fields.');
        }

        if (strlen($data['password']) < 6) {
            return redirect()->back()->withInput()->with('error', 'Password must be at least 6 characters.');
        }

        $user = $userModel->findByEmail($data['email']);
        if ($user) {
            return redirect()->back()->withInput()->with('error', 'An account with this email already exists.');
        }

        if (! $userModel->insert($data)) {
---
INSERT INTO `users` (`name`, `email`, `phone`, `password`, `role`, `is_active`, `email_verified`, `created_at`, `updated_at`) VALUES ('sakshi bhosale', 'sakshibhosale582@gmail.com', '8776765654', '$2y$10$662HxsasBTM1dE8kIKPxb.D80keMEAMaDfAuNmFb0EfnvGdk/VjtG', 'customer', 1, 1, '2026-07-27 16:50:17', '2026-07-27 16:50:17')