app/Models/BannerModel.php

    public function getActive(): array
    {
        return $this->where('status', 1)
            ->orderBy('sort_order', 'ASC')
            ->findAll();
---
SELECT *
FROM `banners`
WHERE `status` = 1
ORDER BY `sort_order` ASC