app/Models/CategoryModel.php

    public function getActive(): array
    {
        return $this->where('status', 1)->orderBy('name', 'ASC')->findAll();
---
SELECT *
FROM `categories`
WHERE `status` = 1
ORDER BY `name` ASC