app/Models/MedicineModel.php

    public function getWithDetails(int|string $idOrSlug): ?array
    {
        $builder = $this->db->table($this->table . ' m')
            ->select('m.*, c.name as category_name, c.slug as category_slug, b.name as brand_name, mf.name as manufacturer_name')
            ->join('categories c', 'c.id = m.category_id', 'left')
            ->join('brands b', 'b.id = m.brand_id', 'left')
            ->join('manufacturers mf', 'mf.id = m.manufacturer_id', 'left');

        if (is_numeric($idOrSlug)) {
            $builder->where('m.id', (int) $idOrSlug);
        } else {
            $builder->where('m.slug', $idOrSlug);
        }

        $medicine = $builder->get()->getRowArray();
---
SELECT `m`.*, `c`.`name` as `category_name`, `c`.`slug` as `category_slug`, `b`.`name` as `brand_name`, `mf`.`name` as `manufacturer_name`
FROM `medicines` `m`
LEFT JOIN `categories` `c` ON `c`.`id` = `m`.`category_id`
LEFT JOIN `brands` `b` ON `b`.`id` = `m`.`brand_id`
LEFT JOIN `manufacturers` `mf` ON `mf`.`id` = `m`.`manufacturer_id`
WHERE `m`.`slug` = 'ecosprin-75'

    public function countSearch(string $keyword = '', array $filters = []): int
    {
        $builder = $this->db->table($this->table . ' m')
            ->join('brands b', 'b.id = m.brand_id', 'left')
            ->where('m.status', 1);

        if ($keyword !== '') {
            $builder->groupStart()
                ->like('m.name', $keyword)
                ->orLike('m.generic_name', $keyword)
                ->orLike('b.name', $keyword)
                ->groupEnd();
        }

        if (! empty($filters['category_id'])) {
            $builder->where('m.category_id', (int) $filters['category_id']);
        }

        if (! empty($filters['brand_id'])) {
            $builder->where('m.brand_id', (int) $filters['brand_id']);
        }

        if (! empty($filters['in_stock'])) {
            $builder->where('m.stock >', 0);
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `medicines` `m`
LEFT JOIN `brands` `b` ON `b`.`id` = `m`.`brand_id`
WHERE `m`.`status` = 1
AND `m`.`category_id` = 5

    public function getFeatured(int $limit = 8): array
    {
        return $this->where('status', 1)
            ->where('stock >', 0)
            ->orderBy('created_at', 'DESC')
            ->limit($limit)
            ->findAll();
---
SELECT *
FROM `medicines`
WHERE `status` = 1
AND `stock` > 0
ORDER BY `created_at` DESC
 LIMIT 8