app/Models/OfferModel.php

SELECT *
FROM `offers`
WHERE `status` = 1
AND `expires_at` >= '2026-07-27 20:43:26'
ORDER BY `created_at` DESC
---
    public function getActive(): array
    {
        return $this->where('status', 1)
            ->where('expires_at >=', date('Y-m-d H:i:s'))
            ->orderBy('created_at', 'DESC')
            ->findAll();