app/Models/OrderModel.php

SELECT *
FROM `orders`
WHERE `user_id` = 4
ORDER BY `created_at` DESC
 LIMIT 20
---
    public function getByUserWithItems(?int $userId, int $limit = 10): array
    {
        if ($userId === null) {
            return [];
        }

        $orders = $this->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->limit($limit)
            ->findAll();