app/Models/ReviewModel.php

SELECT `reviews`.*, `users`.`name` as `user_name`
FROM `reviews`
LEFT JOIN `users` ON `users`.`id` = `reviews`.`user_id`
WHERE `reviews`.`medicine_id` = 19
AND `reviews`.`status` = 'approved'
ORDER BY `reviews`.`created_at` DESC
---
    public function getByMedicine(int $medicineId): array
    {
        return $this->select('reviews.*, users.name as user_name')
            ->join('users', 'users.id = reviews.user_id', 'left')
            ->where('reviews.medicine_id', $medicineId)
            ->where('reviews.status', 'approved')
            ->orderBy('reviews.created_at', 'DESC')
            ->findAll();